# Используем официальный образ Node.js в качестве базового образа
FROM node:14

# Устанавливаем рабочую директорию в /app
WORKDIR /app

# Копируем файлы package.json и package-lock.json в текущую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы в текущую директорию
COPY . .

# Собираем приложение
RUN npm run build

# Экспонируем порт 3000, который используется Create React App
EXPOSE 3000

# Команда для запуска приложения при запуске контейнера
CMD ["npm", "start"]
